SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_aes.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG28 AES register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG28_AES_H
#define EFR32SG28_AES_H

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG28_AES AES
 * @{
 * @brief EFR32SG28 AES Register Declaration.
 *****************************************************************************/

/** AES Register Declaration. */
typedef struct
{
  __IOM uint32_t             FETCHADDR;              /**< Fetcher Address                                    */
        uint32_t             RESERVED0[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             FETCHLEN;               /**< Fetcher Length                                     */
  __IOM uint32_t             FETCHTAG;               /**< Fetcher Tag                                        */
  __IOM uint32_t             PUSHADDR;               /**< Pusher Address                                     */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             PUSHLEN;                /**< Pusher Length                                      */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable                                   */
        uint32_t             RESERVED2[2U];          /**< Reserved for future use                            */
  __IM  uint32_t             IF;                     /**< Interrupt Flags                                    */
        uint32_t             RESERVED3[1U];          /**< Reserved for future use                            */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt status clear                             */
  __IOM uint32_t             CTRL;                   /**< Control register                                   */
  __IOM uint32_t             CMD;                    /**< Command register                                   */
  __IM  uint32_t             STATUS;                 /**< Status register                                    */
        uint32_t             RESERVED4[240U];   /**< Reserved for future use                            */
  __IM  uint32_t             INCL_IPS_HW_CFG;        /**< INCL_IPS_HW_CFG                                    */
  __IM  uint32_t             BA411E_HW_CFG_1;        /**< BA411E_HW_CFG_1                                    */
  __IM  uint32_t             BA411E_HW_CFG_2;        /**< BA411E_HW_CFG_2                                    */
  __IM  uint32_t             BA413_HW_CFG;           /**< BA413_HW_CFG                                       */
  __IM  uint32_t             BA418_HW_CFG;           /**< BA418_HW_CFG                                       */
  __IM  uint32_t             BA419_HW_CFG;           /**< BA419_HW_CFG                                       */
} AES_TypeDef;
/** @} End of group EFR32SG28_AES */

/**************************************************************************//**
 * @addtogroup EFR32SG28_AES
 * @{
 * @defgroup EFR32SG28_AES_BitFields AES Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for AES FETCHADDR */
#define _AES_FETCHADDR_RESETVALUE               0x00000000UL                            /**< Default value for AES_FETCHADDR             */
#define _AES_FETCHADDR_MASK                     0xFFFFFFFFUL                            /**< Mask for AES_FETCHADDR                      */
#define _AES_FETCHADDR_ADDR_SHIFT               0                                       /**< Shift value for AES_ADDR                    */
#define _AES_FETCHADDR_ADDR_MASK                0xFFFFFFFFUL                            /**< Bit mask for AES_ADDR                       */
#define _AES_FETCHADDR_ADDR_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for AES_FETCHADDR              */
#define AES_FETCHADDR_ADDR_DEFAULT              (_AES_FETCHADDR_ADDR_DEFAULT << 0)      /**< Shifted mode DEFAULT for AES_FETCHADDR      */

/* Bit fields for AES FETCHLEN */
#define _AES_FETCHLEN_RESETVALUE                0x00000000UL                            /**< Default value for AES_FETCHLEN              */
#define _AES_FETCHLEN_MASK                      0x3FFFFFFFUL                            /**< Mask for AES_FETCHLEN                       */
#define _AES_FETCHLEN_LENGTH_SHIFT              0                                       /**< Shift value for AES_LENGTH                  */
#define _AES_FETCHLEN_LENGTH_MASK               0xFFFFFFFUL                             /**< Bit mask for AES_LENGTH                     */
#define _AES_FETCHLEN_LENGTH_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for AES_FETCHLEN               */
#define AES_FETCHLEN_LENGTH_DEFAULT             (_AES_FETCHLEN_LENGTH_DEFAULT << 0)     /**< Shifted mode DEFAULT for AES_FETCHLEN       */
#define AES_FETCHLEN_CONSTADDR                  (0x1UL << 28)                           /**< Constant address                            */
#define _AES_FETCHLEN_CONSTADDR_SHIFT           28                                      /**< Shift value for AES_CONSTADDR               */
#define _AES_FETCHLEN_CONSTADDR_MASK            0x10000000UL                            /**< Bit mask for AES_CONSTADDR                  */
#define _AES_FETCHLEN_CONSTADDR_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for AES_FETCHLEN               */
#define AES_FETCHLEN_CONSTADDR_DEFAULT          (_AES_FETCHLEN_CONSTADDR_DEFAULT << 28) /**< Shifted mode DEFAULT for AES_FETCHLEN       */
#define AES_FETCHLEN_REALIGN                    (0x1UL << 29)                           /**< Realign lengh                               */
#define _AES_FETCHLEN_REALIGN_SHIFT             29                                      /**< Shift value for AES_REALIGN                 */
#define _AES_FETCHLEN_REALIGN_MASK              0x20000000UL                            /**< Bit mask for AES_REALIGN                    */
#define _AES_FETCHLEN_REALIGN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for AES_FETCHLEN               */
#define AES_FETCHLEN_REALIGN_DEFAULT            (_AES_FETCHLEN_REALIGN_DEFAULT << 29)   /**< Shifted mode DEFAULT for AES_FETCHLEN       */

