SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_aes.h
/* Bit fields for AES FETCHTAG */
#define _AES_FETCHTAG_RESETVALUE                0x00000000UL                            /**< Default value for AES_FETCHTAG              */
#define _AES_FETCHTAG_MASK                      0xFFFFFFFFUL                            /**< Mask for AES_FETCHTAG                       */
#define _AES_FETCHTAG_TAG_SHIFT                 0                                       /**< Shift value for AES_TAG                     */
#define _AES_FETCHTAG_TAG_MASK                  0xFFFFFFFFUL                            /**< Bit mask for AES_TAG                        */
#define _AES_FETCHTAG_TAG_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for AES_FETCHTAG               */
#define AES_FETCHTAG_TAG_DEFAULT                (_AES_FETCHTAG_TAG_DEFAULT << 0)        /**< Shifted mode DEFAULT for AES_FETCHTAG       */

/* Bit fields for AES PUSHADDR */
#define _AES_PUSHADDR_RESETVALUE                0x00000000UL                            /**< Default value for AES_PUSHADDR              */
#define _AES_PUSHADDR_MASK                      0xFFFFFFFFUL                            /**< Mask for AES_PUSHADDR                       */
#define _AES_PUSHADDR_ADDR_SHIFT                0                                       /**< Shift value for AES_ADDR                    */
#define _AES_PUSHADDR_ADDR_MASK                 0xFFFFFFFFUL                            /**< Bit mask for AES_ADDR                       */
#define _AES_PUSHADDR_ADDR_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for AES_PUSHADDR               */
#define AES_PUSHADDR_ADDR_DEFAULT               (_AES_PUSHADDR_ADDR_DEFAULT << 0)       /**< Shifted mode DEFAULT for AES_PUSHADDR       */

/* Bit fields for AES PUSHLEN */
#define _AES_PUSHLEN_RESETVALUE                 0x00000000UL                            /**< Default value for AES_PUSHLEN               */
#define _AES_PUSHLEN_MASK                       0x7FFFFFFFUL                            /**< Mask for AES_PUSHLEN                        */
#define _AES_PUSHLEN_LENGTH_SHIFT               0                                       /**< Shift value for AES_LENGTH                  */
#define _AES_PUSHLEN_LENGTH_MASK                0xFFFFFFFUL                             /**< Bit mask for AES_LENGTH                     */
#define _AES_PUSHLEN_LENGTH_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for AES_PUSHLEN                */
#define AES_PUSHLEN_LENGTH_DEFAULT              (_AES_PUSHLEN_LENGTH_DEFAULT << 0)      /**< Shifted mode DEFAULT for AES_PUSHLEN        */
#define AES_PUSHLEN_CONSTADDR                   (0x1UL << 28)                           /**< Constant address                            */
#define _AES_PUSHLEN_CONSTADDR_SHIFT            28                                      /**< Shift value for AES_CONSTADDR               */
#define _AES_PUSHLEN_CONSTADDR_MASK             0x10000000UL                            /**< Bit mask for AES_CONSTADDR                  */
#define _AES_PUSHLEN_CONSTADDR_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for AES_PUSHLEN                */
#define AES_PUSHLEN_CONSTADDR_DEFAULT           (_AES_PUSHLEN_CONSTADDR_DEFAULT << 28)  /**< Shifted mode DEFAULT for AES_PUSHLEN        */
#define AES_PUSHLEN_REALIGN                     (0x1UL << 29)                           /**< Realign length                              */
#define _AES_PUSHLEN_REALIGN_SHIFT              29                                      /**< Shift value for AES_REALIGN                 */
#define _AES_PUSHLEN_REALIGN_MASK               0x20000000UL                            /**< Bit mask for AES_REALIGN                    */
#define _AES_PUSHLEN_REALIGN_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for AES_PUSHLEN                */
#define AES_PUSHLEN_REALIGN_DEFAULT             (_AES_PUSHLEN_REALIGN_DEFAULT << 29)    /**< Shifted mode DEFAULT for AES_PUSHLEN        */
#define AES_PUSHLEN_DISCARD                     (0x1UL << 30)                           /**< Discard data                                */
#define _AES_PUSHLEN_DISCARD_SHIFT              30                                      /**< Shift value for AES_DISCARD                 */
#define _AES_PUSHLEN_DISCARD_MASK               0x40000000UL                            /**< Bit mask for AES_DISCARD                    */
#define _AES_PUSHLEN_DISCARD_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for AES_PUSHLEN                */
#define AES_PUSHLEN_DISCARD_DEFAULT             (_AES_PUSHLEN_DISCARD_DEFAULT << 30)    /**< Shifted mode DEFAULT for AES_PUSHLEN        */

/* Bit fields for AES IEN */
#define _AES_IEN_RESETVALUE                     0x00000000UL                            /**< Default value for AES_IEN                   */
#define _AES_IEN_MASK                           0x0000003FUL                            /**< Mask for AES_IEN                            */
#define AES_IEN_FETCHERENDOFBLOCK               (0x1UL << 0)                            /**< End of block interrupt enable               */
#define _AES_IEN_FETCHERENDOFBLOCK_SHIFT        0                                       /**< Shift value for AES_FETCHERENDOFBLOCK       */
#define _AES_IEN_FETCHERENDOFBLOCK_MASK         0x1UL                                   /**< Bit mask for AES_FETCHERENDOFBLOCK          */
#define _AES_IEN_FETCHERENDOFBLOCK_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for AES_IEN                    */
#define AES_IEN_FETCHERENDOFBLOCK_DEFAULT       (_AES_IEN_FETCHERENDOFBLOCK_DEFAULT << 0) /**< Shifted mode DEFAULT for AES_IEN            */
#define AES_IEN_FETCHERSTOPPED                  (0x1UL << 1)                            /**< Stopped interrupt enable                    */
#define _AES_IEN_FETCHERSTOPPED_SHIFT           1                                       /**< Shift value for AES_FETCHERSTOPPED          */
#define _AES_IEN_FETCHERSTOPPED_MASK            0x2UL                                   /**< Bit mask for AES_FETCHERSTOPPED             */
#define _AES_IEN_FETCHERSTOPPED_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for AES_IEN                    */
#define AES_IEN_FETCHERSTOPPED_DEFAULT          (_AES_IEN_FETCHERSTOPPED_DEFAULT << 1)  /**< Shifted mode DEFAULT for AES_IEN            */
#define AES_IEN_FETCHERERROR                    (0x1UL << 2)                            /**< Error interrupt enable                      */
#define _AES_IEN_FETCHERERROR_SHIFT             2                                       /**< Shift value for AES_FETCHERERROR            */
#define _AES_IEN_FETCHERERROR_MASK              0x4UL                                   /**< Bit mask for AES_FETCHERERROR               */
#define _AES_IEN_FETCHERERROR_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for AES_IEN                    */
#define AES_IEN_FETCHERERROR_DEFAULT            (_AES_IEN_FETCHERERROR_DEFAULT << 2)    /**< Shifted mode DEFAULT for AES_IEN            */
#define AES_IEN_PUSHERENDOFBLOCK                (0x1UL << 3)                            /**< End of block interrupt enable               */
#define _AES_IEN_PUSHERENDOFBLOCK_SHIFT         3                                       /**< Shift value for AES_PUSHERENDOFBLOCK        */
#define _AES_IEN_PUSHERENDOFBLOCK_MASK          0x8UL                                   /**< Bit mask for AES_PUSHERENDOFBLOCK           */
#define _AES_IEN_PUSHERENDOFBLOCK_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for AES_IEN                    */
#define AES_IEN_PUSHERENDOFBLOCK_DEFAULT        (_AES_IEN_PUSHERENDOFBLOCK_DEFAULT << 3) /**< Shifted mode DEFAULT for AES_IEN            */
#define AES_IEN_PUSHERSTOPPED                   (0x1UL << 4)                            /**< Stopped interrupt enable                    */
#define _AES_IEN_PUSHERSTOPPED_SHIFT            4                                       /**< Shift value for AES_PUSHERSTOPPED           */
#define _AES_IEN_PUSHERSTOPPED_MASK             0x10UL                                  /**< Bit mask for AES_PUSHERSTOPPED              */
#define _AES_IEN_PUSHERSTOPPED_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for AES_IEN                    */
#define AES_IEN_PUSHERSTOPPED_DEFAULT           (_AES_IEN_PUSHERSTOPPED_DEFAULT << 4)   /**< Shifted mode DEFAULT for AES_IEN            */
#define AES_IEN_PUSHERERROR                     (0x1UL << 5)                            /**< Error interrupt enable                      */
#define _AES_IEN_PUSHERERROR_SHIFT              5                                       /**< Shift value for AES_PUSHERERROR             */
#define _AES_IEN_PUSHERERROR_MASK               0x20UL                                  /**< Bit mask for AES_PUSHERERROR                */
#define _AES_IEN_PUSHERERROR_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for AES_IEN                    */
#define AES_IEN_PUSHERERROR_DEFAULT             (_AES_IEN_PUSHERERROR_DEFAULT << 5)     /**< Shifted mode DEFAULT for AES_IEN            */

/* Bit fields for AES IF */
#define _AES_IF_RESETVALUE                      0x00000000UL                            /**< Default value for AES_IF                    */
#define _AES_IF_MASK                            0x0000003FUL                            /**< Mask for AES_IF                             */
#define AES_IF_FETCHERENDOFBLOCK                (0x1UL << 0)                            /**< End of block interrupt flag                 */
#define _AES_IF_FETCHERENDOFBLOCK_SHIFT         0                                       /**< Shift value for AES_FETCHERENDOFBLOCK       */
#define _AES_IF_FETCHERENDOFBLOCK_MASK          0x1UL                                   /**< Bit mask for AES_FETCHERENDOFBLOCK          */
#define _AES_IF_FETCHERENDOFBLOCK_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for AES_IF                     */
#define AES_IF_FETCHERENDOFBLOCK_DEFAULT        (_AES_IF_FETCHERENDOFBLOCK_DEFAULT << 0) /**< Shifted mode DEFAULT for AES_IF             */
#define AES_IF_FETCHERSTOPPED                   (0x1UL << 1)                            /**< Stopped interrupt flag                      */
#define _AES_IF_FETCHERSTOPPED_SHIFT            1                                       /**< Shift value for AES_FETCHERSTOPPED          */
#define _AES_IF_FETCHERSTOPPED_MASK             0x2UL                                   /**< Bit mask for AES_FETCHERSTOPPED             */
#define _AES_IF_FETCHERSTOPPED_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for AES_IF                     */
#define AES_IF_FETCHERSTOPPED_DEFAULT           (_AES_IF_FETCHERSTOPPED_DEFAULT << 1)   /**< Shifted mode DEFAULT for AES_IF             */
#define AES_IF_FETCHERERROR                     (0x1UL << 2)                            /**< Error interrupt flag                        */
#define _AES_IF_FETCHERERROR_SHIFT              2                                       /**< Shift value for AES_FETCHERERROR            */
#define _AES_IF_FETCHERERROR_MASK               0x4UL                                   /**< Bit mask for AES_FETCHERERROR               */
#define _AES_IF_FETCHERERROR_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for AES_IF                     */
#define AES_IF_FETCHERERROR_DEFAULT             (_AES_IF_FETCHERERROR_DEFAULT << 2)     /**< Shifted mode DEFAULT for AES_IF             */
#define AES_IF_PUSHERENDOFBLOCK                 (0x1UL << 3)                            /**< End of block interrupt flag                 */
#define _AES_IF_PUSHERENDOFBLOCK_SHIFT          3                                       /**< Shift value for AES_PUSHERENDOFBLOCK        */
#define _AES_IF_PUSHERENDOFBLOCK_MASK           0x8UL                                   /**< Bit mask for AES_PUSHERENDOFBLOCK           */
#define _AES_IF_PUSHERENDOFBLOCK_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for AES_IF                     */
#define AES_IF_PUSHERENDOFBLOCK_DEFAULT         (_AES_IF_PUSHERENDOFBLOCK_DEFAULT << 3) /**< Shifted mode DEFAULT for AES_IF             */
#define AES_IF_PUSHERSTOPPED                    (0x1UL << 4)                            /**< Stopped interrupt flag                      */
#define _AES_IF_PUSHERSTOPPED_SHIFT             4                                       /**< Shift value for AES_PUSHERSTOPPED           */
#define _AES_IF_PUSHERSTOPPED_MASK              0x10UL                                  /**< Bit mask for AES_PUSHERSTOPPED              */
#define _AES_IF_PUSHERSTOPPED_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for AES_IF                     */
#define AES_IF_PUSHERSTOPPED_DEFAULT            (_AES_IF_PUSHERSTOPPED_DEFAULT << 4)    /**< Shifted mode DEFAULT for AES_IF             */
#define AES_IF_PUSHERERROR                      (0x1UL << 5)                            /**< Error interrupt flag                        */
#define _AES_IF_PUSHERERROR_SHIFT               5                                       /**< Shift value for AES_PUSHERERROR             */
#define _AES_IF_PUSHERERROR_MASK                0x20UL                                  /**< Bit mask for AES_PUSHERERROR                */
#define _AES_IF_PUSHERERROR_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for AES_IF                     */
#define AES_IF_PUSHERERROR_DEFAULT              (_AES_IF_PUSHERERROR_DEFAULT << 5)      /**< Shifted mode DEFAULT for AES_IF             */

/* Bit fields for AES IF_CLR */
#define _AES_IF_CLR_RESETVALUE                  0x00000000UL                            /**< Default value for AES_IF_CLR                */
#define _AES_IF_CLR_MASK                        0x0000003FUL                            /**< Mask for AES_IF_CLR                         */
#define AES_IF_CLR_FETCHERENDOFBLOCK            (0x1UL << 0)                            /**< End of block interrupt flag clear           */
#define _AES_IF_CLR_FETCHERENDOFBLOCK_SHIFT     0                                       /**< Shift value for AES_FETCHERENDOFBLOCK       */
#define _AES_IF_CLR_FETCHERENDOFBLOCK_MASK      0x1UL                                   /**< Bit mask for AES_FETCHERENDOFBLOCK          */
#define _AES_IF_CLR_FETCHERENDOFBLOCK_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for AES_IF_CLR                 */
#define AES_IF_CLR_FETCHERENDOFBLOCK_DEFAULT    (_AES_IF_CLR_FETCHERENDOFBLOCK_DEFAULT << 0) /**< Shifted mode DEFAULT for AES_IF_CLR         */
#define AES_IF_CLR_FETCHERSTOPPED               (0x1UL << 1)                            /**< Stopped interrupt flag clear                */
#define _AES_IF_CLR_FETCHERSTOPPED_SHIFT        1                                       /**< Shift value for AES_FETCHERSTOPPED          */
#define _AES_IF_CLR_FETCHERSTOPPED_MASK         0x2UL                                   /**< Bit mask for AES_FETCHERSTOPPED             */
#define _AES_IF_CLR_FETCHERSTOPPED_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for AES_IF_CLR                 */
#define AES_IF_CLR_FETCHERSTOPPED_DEFAULT       (_AES_IF_CLR_FETCHERSTOPPED_DEFAULT << 1) /**< Shifted mode DEFAULT for AES_IF_CLR         */
#define AES_IF_CLR_FETCHERERROR                 (0x1UL << 2)                            /**< Error interrupt flag clear                  */
#define _AES_IF_CLR_FETCHERERROR_SHIFT          2                                       /**< Shift value for AES_FETCHERERROR            */
#define _AES_IF_CLR_FETCHERERROR_MASK           0x4UL                                   /**< Bit mask for AES_FETCHERERROR               */
#define _AES_IF_CLR_FETCHERERROR_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for AES_IF_CLR                 */
#define AES_IF_CLR_FETCHERERROR_DEFAULT         (_AES_IF_CLR_FETCHERERROR_DEFAULT << 2) /**< Shifted mode DEFAULT for AES_IF_CLR         */
#define AES_IF_CLR_PUSHERENDOFBLOCK             (0x1UL << 3)                            /**< FETCHERENDOFBLOCKIFC                        */
#define _AES_IF_CLR_PUSHERENDOFBLOCK_SHIFT      3                                       /**< Shift value for AES_PUSHERENDOFBLOCK        */
#define _AES_IF_CLR_PUSHERENDOFBLOCK_MASK       0x8UL                                   /**< Bit mask for AES_PUSHERENDOFBLOCK           */
#define _AES_IF_CLR_PUSHERENDOFBLOCK_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for AES_IF_CLR                 */
#define AES_IF_CLR_PUSHERENDOFBLOCK_DEFAULT     (_AES_IF_CLR_PUSHERENDOFBLOCK_DEFAULT << 3) /**< Shifted mode DEFAULT for AES_IF_CLR         */
#define AES_IF_CLR_PUSHERSTOPPED                (0x1UL << 4)                            /**< FETCHERSTOPPEDIFC                           */
#define _AES_IF_CLR_PUSHERSTOPPED_SHIFT         4                                       /**< Shift value for AES_PUSHERSTOPPED           */
#define _AES_IF_CLR_PUSHERSTOPPED_MASK          0x10UL                                  /**< Bit mask for AES_PUSHERSTOPPED              */
#define _AES_IF_CLR_PUSHERSTOPPED_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for AES_IF_CLR                 */
#define AES_IF_CLR_PUSHERSTOPPED_DEFAULT        (_AES_IF_CLR_PUSHERSTOPPED_DEFAULT << 4) /**< Shifted mode DEFAULT for AES_IF_CLR         */
#define AES_IF_CLR_PUSHERERROR                  (0x1UL << 5)                            /**< FETCHERERRORIFC                             */
#define _AES_IF_CLR_PUSHERERROR_SHIFT           5                                       /**< Shift value for AES_PUSHERERROR             */
#define _AES_IF_CLR_PUSHERERROR_MASK            0x20UL                                  /**< Bit mask for AES_PUSHERERROR                */
#define _AES_IF_CLR_PUSHERERROR_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for AES_IF_CLR                 */
#define AES_IF_CLR_PUSHERERROR_DEFAULT          (_AES_IF_CLR_PUSHERERROR_DEFAULT << 5)  /**< Shifted mode DEFAULT for AES_IF_CLR         */

/* Bit fields for AES CTRL */
#define _AES_CTRL_RESETVALUE                    0x00000000UL                            /**< Default value for AES_CTRL                  */
#define _AES_CTRL_MASK                          0x0000001FUL                            /**< Mask for AES_CTRL                           */
#define AES_CTRL_FETCHERSCATTERGATHER           (0x1UL << 0)                            /**< Fetcher scatter/gather                      */
#define _AES_CTRL_FETCHERSCATTERGATHER_SHIFT    0                                       /**< Shift value for AES_FETCHERSCATTERGATHER    */
#define _AES_CTRL_FETCHERSCATTERGATHER_MASK     0x1UL                                   /**< Bit mask for AES_FETCHERSCATTERGATHER       */
#define _AES_CTRL_FETCHERSCATTERGATHER_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for AES_CTRL                   */
#define AES_CTRL_FETCHERSCATTERGATHER_DEFAULT   (_AES_CTRL_FETCHERSCATTERGATHER_DEFAULT << 0) /**< Shifted mode DEFAULT for AES_CTRL           */
#define AES_CTRL_PUSHERSCATTERGATHER            (0x1UL << 1)                            /**< Pusher scatter/gather                       */
#define _AES_CTRL_PUSHERSCATTERGATHER_SHIFT     1                                       /**< Shift value for AES_PUSHERSCATTERGATHER     */
#define _AES_CTRL_PUSHERSCATTERGATHER_MASK      0x2UL                                   /**< Bit mask for AES_PUSHERSCATTERGATHER        */
#define _AES_CTRL_PUSHERSCATTERGATHER_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for AES_CTRL                   */
#define AES_CTRL_PUSHERSCATTERGATHER_DEFAULT    (_AES_CTRL_PUSHERSCATTERGATHER_DEFAULT << 1) /**< Shifted mode DEFAULT for AES_CTRL           */
#define AES_CTRL_STOPFETCHER                    (0x1UL << 2)                            /**< Stop fetcher                                */
#define _AES_CTRL_STOPFETCHER_SHIFT             2                                       /**< Shift value for AES_STOPFETCHER             */
#define _AES_CTRL_STOPFETCHER_MASK              0x4UL                                   /**< Bit mask for AES_STOPFETCHER                */
#define _AES_CTRL_STOPFETCHER_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for AES_CTRL                   */
#define AES_CTRL_STOPFETCHER_DEFAULT            (_AES_CTRL_STOPFETCHER_DEFAULT << 2)    /**< Shifted mode DEFAULT for AES_CTRL           */
#define AES_CTRL_STOPPUSHER                     (0x1UL << 3)                            /**< Stop pusher                                 */
#define _AES_CTRL_STOPPUSHER_SHIFT              3                                       /**< Shift value for AES_STOPPUSHER              */
#define _AES_CTRL_STOPPUSHER_MASK               0x8UL                                   /**< Bit mask for AES_STOPPUSHER                 */
#define _AES_CTRL_STOPPUSHER_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for AES_CTRL                   */
#define AES_CTRL_STOPPUSHER_DEFAULT             (_AES_CTRL_STOPPUSHER_DEFAULT << 3)     /**< Shifted mode DEFAULT for AES_CTRL           */
#define AES_CTRL_SWRESET                        (0x1UL << 4)                            /**< Software reset                              */
#define _AES_CTRL_SWRESET_SHIFT                 4                                       /**< Shift value for AES_SWRESET                 */
#define _AES_CTRL_SWRESET_MASK                  0x10UL                                  /**< Bit mask for AES_SWRESET                    */
#define _AES_CTRL_SWRESET_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for AES_CTRL                   */
#define AES_CTRL_SWRESET_DEFAULT                (_AES_CTRL_SWRESET_DEFAULT << 4)        /**< Shifted mode DEFAULT for AES_CTRL           */

/* Bit fields for AES CMD */
#define _AES_CMD_RESETVALUE                     0x00000000UL                            /**< Default value for AES_CMD                   */
#define _AES_CMD_MASK                           0x00000003UL                            /**< Mask for AES_CMD                            */
#define AES_CMD_STARTFETCHER                    (0x1UL << 0)                            /**< Start fetch                                 */
#define _AES_CMD_STARTFETCHER_SHIFT             0                                       /**< Shift value for AES_STARTFETCHER            */
#define _AES_CMD_STARTFETCHER_MASK              0x1UL                                   /**< Bit mask for AES_STARTFETCHER               */
#define _AES_CMD_STARTFETCHER_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for AES_CMD                    */
#define AES_CMD_STARTFETCHER_DEFAULT            (_AES_CMD_STARTFETCHER_DEFAULT << 0)    /**< Shifted mode DEFAULT for AES_CMD            */
#define AES_CMD_STARTPUSHER                     (0x1UL << 1)                            /**< Start push                                  */
#define _AES_CMD_STARTPUSHER_SHIFT              1                                       /**< Shift value for AES_STARTPUSHER             */
#define _AES_CMD_STARTPUSHER_MASK               0x2UL                                   /**< Bit mask for AES_STARTPUSHER                */
#define _AES_CMD_STARTPUSHER_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for AES_CMD                    */
#define AES_CMD_STARTPUSHER_DEFAULT             (_AES_CMD_STARTPUSHER_DEFAULT << 1)     /**< Shifted mode DEFAULT for AES_CMD            */

